blueskycoco/rt-thread/bsp/tm4c129x/applications/con_common.c
    /* find new console device */
    new = rt_device_find(name);
    if (new != RT_NULL)
    {
        if (_console_device_tt != RT_NULL)
        {
            /* close old console device */
            rt_device_close(_console_device_tt);
        }

        /* set new console device */
        _console_device_tt = new;
        rt_device_open(_console_device_tt, RT_DEVICE_OFLAG_RDWR | RT_DEVICE_FLAG_STREAM);
    }

    return old;
}

void rtt_kprintf(const char *fmt, ...)
{
    va_list args;
    rt_size_t length;
    static char rt_log_buf[RT_CONSOLEBUF_SIZE];

    va_start(args, fmt);
    /* the return value of vsnprintf is the number of bytes that would be
     * written to buffer had if the size of the buffer been sufficiently
     * large excluding the terminating null byte. If the output string
     * would be larger than the rt_log_buf, we have to adjust the output
     * length. */
    length = rt_vsnprintf(rt_log_buf, sizeof(rt_log_buf) - 1, fmt, args);
    if (length > RT_CONSOLEBUF_SIZE - 1)
        length = RT_CONSOLEBUF_SIZE - 1;
#ifdef RT_USING_DEVICE
    if (_console_device_tt == RT_NULL)
    {
        rtt_console_set_device(rt_log_buf);
    }
    else
    {
        rt_uint16_t old_flag = _console_device_tt->open_flag;

        _console_device_tt->open_flag |= RT_DEVICE_FLAG_STREAM;
        rt_device_write(_console_device_tt, 0, rt_log_buf, length);
        _console_device_tt->open_flag = old_flag;
    }
#else
    rtt_console_set_device(rt_log_buf);
#endif
    va_end(args);
}

void bus_speed_test(void *param)
{
	rt_uint8_t config_ip[]={0xF5,0x8A,0x00,0xc0,0xa8,0x01,0x67,0x26,0xfa,0x00,0x00};
	rt_uint8_t config_tcp[]={0xF5,0x8A,0x21,0x01,0x26,0xfa,0x02,0xc1};
	rt_uint8_t config_tcp1[]={0xF5,0x8A,0x21,0x00,0x26,0xfa,0x02,0xc1};
	rt_uint8_t config_rport[]={0xF5,0x8A,0x10,0x08,0xc4,0x26,0xfa,0x00,0x00};	
	rt_uint8_t config_rport2[]={0xF5,0x8A,0x10,0x04,0xd2,0x26,0xfa,0x00,0x00};
	rt_uint8_t config_socket_mode0[]	={0xF5,0x8A,0x18,0x01,0x26,0xfa,0x00,0x00};
	rt_uint8_t config_socket_mode1[]	={0xF5,0x8A,0x18,0x00,0x26,0xfa,0x00,0x00};
	rt_uint8_t config_rport1[]={0xF5,0x8A,0x10,0x08,0xba,0x26,0xfa,0x00,0x00};	
	rt_uint8_t config_net_protol0[]	={0xF5,0x8A,0x14,0x01,0x26,0xfa,0x00,0x00};/*ipv4 or ipv6 0*/
	rt_uint8_t config_net_protol1[]	={0xF5,0x8A,0x14,0x00,0x26,0xfa,0x00,0x00};/*ipv4 or ipv6 0*/
	//rt_uint8_t config_ripv6[]={0xf5,0x8a,0x0c,0x1c,0x66,0x65,0x38,0x30,0x3a,0x3a,0x61
	//	,0x31,0x64,0x31,0x3a,0x63,0x62,0x31,0x65,0x3a,0x62,0x61,0x61,0x63,0x3a,0x36,0x33,0x33,0x66,0x25,0x31,0x31,0xff
	//	,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff
	//	,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0xff,0x26,0xfa,0x2d,0x8b};
	rt_uint8_t config_ripv6[]={0xf5,0x8a ,0x0c ,0x1a ,0x66 ,0x65 ,0x38 ,0x30 ,0x3a ,0x3a ,0x64 ,0x37 ,0x30 ,0x3a ,0x66 ,0x39 ,0x61
	,0x3a ,0x63 ,0x63 ,0x64 ,0x32 ,0x3a ,0x31 ,0x63 ,0x37 ,0x32 ,0x25 ,0x31 ,0x33 ,0xff ,0xff ,0xff ,0xff ,0xff ,0xff ,0xff ,0xff
	,0xff ,0xff ,0xff ,0xff ,0xff ,0xff ,0xff ,0xff ,0xff ,0xff ,0xff ,0xff ,0xff ,0xff ,0xff ,0xff ,0xff ,0xff ,0xff ,0xff ,0xff 
	,0xff ,0xff ,0xff ,0xff ,0xff ,0xff ,0xff ,0xff ,0x26 ,0xfa ,0x2e ,0xa2};
	unsigned char network_state0[]={0xF5,0x8B,0x26};
	char buf[1022]={0};
	long times=102601;
	long i=0;
	rtt_console_set_device(RT_CONSOLE_DEVICE_NAME);
	memset(buf,0x38,1020);
	for(i=33;i<127;i++)
		buf[i-33]=i;
	for(i=1;i<11;i++)
	memcpy(buf+93*i+1,buf,93);
	memcpy(buf+931,buf,91);
	//while(start_bus_speed==0)
	//	rt_thread_delay(1);
	rtt_kprintf("===============================================\n");
	rtt_kprintf("Board IPv4:192.168.1.103 Port 1234\n\tUDP IPv6:FE80::1\n");
	rtt_kprintf("PC IPv4:192.168.1.100 Port 1234\n\tUDP IPv6:fe80::216:17ff:fe89:870b%%4\n");
	rtt_kprintf("===============================================\n");
	rtt_kprintf("start bus test 1\nBoard UDP IPV4<==> PC UDP IPV4\n");
	
	rt_hw_led_on();
	for(i=0;i<times;i++){		
		check_meminfo();
		_epi_write(0,buf,1020,0);}
	rt_hw_led_off();
	rtt_kprintf("end test 1\n");
	config_ip[6]=config_ip[6]+1;
	rtt_kprintf("\n\nswitch Device from UDP to TCP\n\n");
	rt_thread_delay(300);
	_epi_send_config(config_tcp,sizeof(config_tcp));
	rt_thread_delay(100);
	_epi_read_config(network_state0,sizeof(network_state0));
	rtt_kprintf("\n\nDEVICE CONNECTED!!!\n\n");
	rt_hw_led_on();
	rtt_kprintf("start bus test 2\nBoard TCP Client IPV4<==> PC TCP Server IPV4\n");
	for(i=0;i<times;i++)
	{		
		check_meminfo();
		_epi_write(0,buf,1020,0);
	}
	rt_hw_led_off();
	rtt_kprintf("end test 2\n");
	#if 0
	rtt_kprintf("\n\nswitch PC port from 1234 to 2244\n\n");
	rt_thread_delay(300);
	_epi_send_config(config_rport,sizeof(config_rport));
	rt_thread_delay(100);
	_epi_read_config(network_state0,sizeof(network_state0));
	rtt_kprintf("\n\nDEVICE CONNECTED!!!\n\n");
	rt_hw_led_on();	
	rtt_kprintf("start bus test 3\n<Device IP:192.168.1.103:1234 Server IP:192.168.1.100:2244 TCP Client IPV4>\n");
	for(i=0;i<times;i++){		
		check_meminfo();
		_epi_write(0,buf,1020,0);}
	rt_hw_led_off();
	rtt_kprintf("end test 3\n");
	#endif
	rtt_kprintf("\n\nswitch Device form client to server\n\n");
	rt_thread_delay(300);
	_epi_send_config(config_socket_mode0,sizeof(config_socket_mode0));
	rt_thread_delay(100);
	_epi_read_config(network_state0,sizeof(network_state0));
	rtt_kprintf("\n\nDEVICE CONNECTED!!!\n\n");
	rt_hw_led_on();
	rtt_kprintf("start bus test 3\nBoard TCP Server IPV4<==> PC TCP Client IPV4\n");
	for(i=0;i<times;i++){		
		check_meminfo();
		_epi_write(0,buf,1020,0);}
	rt_hw_led_off();	
	rtt_kprintf("end test 3\n");
	
	rtt_kprintf("\n\nswitch PC port from IPV4 to IPV6\n\n");
	rt_thread_delay(300);
	_epi_send_config(config_net_protol0,sizeof(config_net_protol0));
	rt_thread_delay(100);
	_epi_read_config(network_state0,sizeof(network_state0));
	rtt_kprintf("\n\nDEVICE CONNECTED!!!\n\n");
	rt_hw_led_on();
	rtt_kprintf("start bus speed test 4\nBoard TCP Server IPV6<==> PC TCP Client IPV6\n");
	for(i=0;i<times;i++){		
		check_meminfo();
		_epi_write(0,buf,1020,0);}
	rt_hw_led_off();
	rtt_kprintf("end test 4\n");
	//rtt_kprintf("\n\nset PC ipv6 to fe80::a1d1:cb1e:baac:633f%%11\n\n");
	rtt_kprintf("\n\nset PC ipv6 to fe80::d70:f9a:ccd2:1c72%%13\n\n");
	rt_thread_delay(300);
	_epi_send_config(config_ripv6,sizeof(config_ripv6));
	rt_thread_delay(100);
	rtt_kprintf("\n\nswitch Device form server to client\n\n");
	//rt_thread_delay(300);
	_epi_send_config(config_socket_mode1,sizeof(config_socket_mode1));
	rt_thread_delay(100);
	_epi_read_config(network_state0,sizeof(network_state0));
	rtt_kprintf("\n\nDEVICE CONNECTED!!!\n\n");
	rt_hw_led_on();
	rtt_kprintf("start bus speed test 5\nBoard TCP Client IPV6<==> PC TCP Server IPV6\n");
	for(i=0;i<times;i++){		
		check_meminfo();
		_epi_write(0,buf,1020,0);}
	rt_hw_led_off();
	rtt_kprintf("end test 5\n");
	
