blueskycoco/rt-thread/bsp/tm4c129x/applications/con_common.c
	rtt_kprintf("\n\nswitch Device from TCP to UDP\n\n");
	_epi_send_config(config_tcp1,sizeof(config_tcp1));
	rt_thread_delay(100);
	_epi_read_config(network_state0,sizeof(network_state0));
	rtt_kprintf("\n\nDEVICE CONNECTED!!!\n\n");
	rt_hw_led_on();
	rtt_kprintf("start bus speed test 6\nBoard UDP IPV6<==> PC UDP IPV6\n");
	for(i=0;i<times;i++){		
		check_meminfo();
		_epi_write(0,buf,1020,0);}
	rt_hw_led_off();
	_epi_send_config(config_net_protol1,sizeof(config_net_protol1));//ipv4
	//rt_thread_delay(100);
	_epi_send_config(config_socket_mode1,sizeof(config_socket_mode1));//client
	//rt_thread_delay(100);	
	_epi_send_config(config_tcp1,sizeof(config_tcp1));//udp
	//rt_thread_delay(100);	
	_epi_send_config(config_rport2,sizeof(config_rport2));//rport 1234
	//rt_thread_delay(100);	
	rtt_kprintf("end test 6\n");
}
/*init common1,2,3,4 for 4 socket*/
int common_init(int dev)//0 uart , 1 parallel bus, 2 usb
{
	/*init common device*/
	rt_err_t result;
	rt_uint8_t common[10];
	int i,max_devices=4;
	/*read config data from internal flash*/
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOK);
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);

	MAP_SysCtlDelay(1);
	//config select
	MAP_GPIOIntDisable(GPIO_PORTD_BASE, GPIO_PIN_2);
	MAP_GPIOPinTypeGPIOInput(GPIO_PORTD_BASE, GPIO_PIN_2);//ind0
	MAP_GPIOIntTypeSet(GPIO_PORTD_BASE, GPIO_PIN_2, GPIO_BOTH_EDGES);
	MAP_IntEnable(INT_GPIOD);
	MAP_GPIOIntEnable(GPIO_PORTD_BASE, GPIO_PIN_2);
	int ui32Status = MAP_GPIOIntStatus(GPIO_PORTD_BASE, true);
	MAP_GPIOIntClear(GPIO_PORTD_BASE, ui32Status);
	//connect ind
	MAP_GPIOPinTypeGPIOOutput(GPIO_PORTE_BASE, GPIO_PIN_5);//CNN1
	MAP_GPIOPinTypeGPIOOutput(GPIO_PORTK_BASE, GPIO_PIN_2);//CNN2
	MAP_GPIOPinTypeGPIOOutput(GPIO_PORTK_BASE, GPIO_PIN_3);//CNN3
	MAP_GPIOPinTypeGPIOOutput(GPIO_PORTB_BASE, GPIO_PIN_4);//CNN4
	MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);	
	MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,0);	
	MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,0);	

	//init GPJ0 int
	MAP_GPIOIntDisable(GPIO_PORTJ_BASE, GPIO_PIN_0);
	MAP_GPIOPinTypeGPIOInput(GPIO_PORTJ_BASE, GPIO_PIN_0);
	MAP_GPIOIntTypeSet(GPIO_PORTJ_BASE, GPIO_PIN_0, GPIO_FALLING_EDGE);
	MAP_IntEnable(INT_GPIOJ);
	MAP_GPIOIntEnable(GPIO_PORTJ_BASE, GPIO_PIN_0);
	ui32Status = MAP_GPIOIntStatus(GPIO_PORTJ_BASE, true);
	MAP_GPIOIntClear(GPIO_PORTJ_BASE, ui32Status);

	default_config();
	memset(config_local_ip,0,11);config_local_ip[11]='\0';
	memset(config_sub_msk,0,11);config_local_ip[11]='\0';
	memset(config_gw,0,11);config_local_ip[11]='\0';
	memset(config_socket3_ip,0,11);config_local_ip[11]='\0';
	memset(config_socket0_ip,0,11);config_local_ip[11]='\0';
	memset(config_socket1_ip,0,11);config_local_ip[11]='\0';
	memset(config_socket2_ip,0,11);config_local_ip[11]='\0';
	memset(config_socket0_local_port,0,9);config_local_ip[11]='\0';
	memset(config_socket1_local_port,0,9);config_local_ip[11]='\0';
	memset(config_socket2_local_port,0,9);config_local_ip[11]='\0';
	memset(config_socket3_local_port,0,9);config_local_ip[11]='\0';
	memset(config_socket0_remote_port,0,9);config_local_ip[11]='\0';
	memset(config_socket1_remote_port,0,9);config_local_ip[11]='\0';
	memset(config_socket2_remote_port,0,9);config_local_ip[11]='\0';
	memset(config_socket3_remote_port,0,9);config_local_ip[11]='\0';
	memset(config_mac,0,13);config_local_ip[11]='\0';
	memset(config_socket0_ip6,0,71);config_local_ip[11]='\0';
	memset(config_socket1_ip6,0,71);config_local_ip[11]='\0';
	memset(config_socket2_ip6,0,71);config_local_ip[11]='\0';
	memset(config_socket3_ip6,0,71);config_local_ip[11]='\0';
	memset(config_local_ip6,0,71);config_local_ip6[71]='\0';
	memset(config_net_protol0,0,8);config_net_protol0[8]='\0';
	memset(config_net_protol1,0,8);config_net_protol1[8]='\0';
	memset(config_net_protol2,0,8);config_net_protol2[8]='\0';
	memset(config_net_protol3,0,8);config_net_protol3[8]='\0';
	memset(config_socket_mode0,0,8);config_socket_mode0[8]='\0';
	memset(config_socket_mode1,0,8);config_socket_mode1[8]='\0';
	memset(config_socket_mode2,0,8);config_socket_mode2[8]='\0';
	memset(config_socket_mode3,0,8);config_socket_mode3[8]='\0';
	memset(config_uart_baud0,0,8);config_uart_baud0[8]='\0';
	memset(config_uart_baud1,0,8);config_uart_baud1[8]='\0';
	memset(config_uart_baud2,0,8);config_uart_baud2[8]='\0';
	memset(config_uart_baud3,0,8);config_uart_baud3[8]='\0';
	memset(config_tcp0,0,8);config_tcp0[8]='\0';
	memset(config_tcp1,0,8);config_tcp1[8]='\0';
	memset(config_tcp2,0,8);config_tcp2[8]='\0';
	memset(config_tcp3,0,8);config_tcp3[8]='\0';
	rt_mutex_init(&mconfigutex, "config_mutex", RT_IPC_FLAG_FIFO);
/*
	for(i=3;i<67;i++)
	{
		config_socket0_ip6[i]=0xff;
		config_socket1_ip6[i]=0xff;
		config_socket2_ip6[i]=0xff;
		config_socket3_ip6[i]=0xff;
		config_local_ip6[i]=0xff;
	}
	config_socket0_ip6[67]=0x26;
	config_socket1_ip6[67]=0x26;
	config_socket2_ip6[67]=0x26;
	config_socket3_ip6[67]=0x26;
	config_local_ip6[67]=0x26;
	config_socket0_ip6[68]=0xfa;
	config_socket1_ip6[68]=0xfa;
	config_socket2_ip6[68]=0xfa;
	config_socket3_ip6[68]=0xfa;
	config_local_ip6[68]=0xfa;
*/
	if(dev==DEV_USB)
	{
		max_devices=2;
		g_dev=1;
	}
	else if(dev==DEV_BUS)
		max_devices=1;
	for(i=0;i<max_devices;i++)
	{
		//config sem		
		if(dev==DEV_USB)
		{
			rt_sprintf(common,"usb_%d_rx",i);
			rt_sem_init(&(usbrx_sem[i]), common, 0, 0);
		}
		else
		{
			rt_sprintf(common,"common_%d_rx",i);
			rt_sem_init(&(rx_sem[i]), common, 0, 0);
		}
		if(dev==DEV_UART)
		{
			if(i==1)
				rt_sprintf(common,"uart%d",4);
			else
				rt_sprintf(common,"uart%d",i);
			if(!phy_link)
				network_state[i]=NETWORK_WIRE_DISCONNECT;
			DBG("To open ==>%s\r\n",common);
			//open uart ,parallel ,usb
			common_dev[i] = rt_device_find(common);
			if (common_dev[i] == RT_NULL)
			{
				DBG("app_common: can not find device: %s\r\n",common);
				return 0;
			}
			if (rt_device_open(common_dev[i], RT_DEVICE_OFLAG_RDWR | RT_DEVICE_FLAG_INT_RX | RT_DEVICE_FLAG_INT_TX) == RT_EOK)
			{
				//create common_w,r thread to read data from socket write to uart,parallel,usb
				//or read from uart,parallel,usb write to socket
				char buf[32]="DEV Opened";
				rt_sprintf(common,"common_wx%d",i);
				tid_common_w[i] = rt_thread_create(common,common_w, (void *)(i*2),4096, 20, 10);
				rt_sprintf(common,"common_rx%d",i);
				tid_common_r[i] = rt_thread_create(common,common_r, (void *)(i*2+1),2048, 20, 10);
				rt_device_write(common_dev[i], 0, buf, strlen(buf));

				rt_device_set_rx_indicate(common_dev[i], common_rx_ind);

				if(tid_common_w[i]!=RT_NULL)
					rt_thread_startup(tid_common_w[i]);			
				if(tid_common_r[i]!=RT_NULL)
					rt_thread_startup(tid_common_r[i]);
			}
			ind[0]=((MAP_GPIOPinRead(GPIO_PORTD_BASE, GPIO_PIN_2)&(GPIO_PIN_2))==GPIO_PIN_2)?RT_TRUE:RT_FALSE;
		}
		else if(dev==DEV_BUS)
		{			
			if(bus_speed_mode==0)
			{
				
				epi_init();
				rt_sprintf(common,"epi_%d_rx",i);
				rt_sem_init(&(rx_sem[0]), common, 0, 0);
				g_dev=2;
				rt_kprintf("epi %d\r\n",i);
				rt_sprintf(common,"common_wx%d",i);
				if(!phy_link)
				network_state[i]=NETWORK_WIRE_DISCONNECT;
				tid_common_w[i] = rt_thread_create(common,common_w_epi, (void *)(i*2),2048, 20, 10);	
				if(tid_common_w[i]!=RT_NULL)
					rt_thread_startup(tid_common_w[i]);	
				rt_sprintf(common,"common_rx%d",i);
				tid_common_r[i] = rt_thread_create(common,common_r, (void *)(i*2+1),4096, 20, 10);
				if(tid_common_r[i]!=RT_NULL)
					rt_thread_startup(tid_common_r[i]);
			}
			else
			{	
				if(i==0)				
				epi_init();
			}
		}
		else
		{
			//init usbbulk,read data from usb,and transfer data to 4 socket thread by 4 ctl line
			//create 4 common_r thread read data from 4 socket thread,and put data to usb,control 4 ind line
			if(i==0)
				_usb_init();
			rt_kprintf("uub %d\r\n",i);
			rt_sprintf(common,"common_wx%d",i);
			tid_common_w[i] = rt_thread_create(common,common_w_usb, (void *)(i*2),4096, 20, 10);	
			if(tid_common_w[i]!=RT_NULL)
				rt_thread_startup(tid_common_w[i]);	
			if(i==0)
			{
				if(!phy_link)
					network_state[i]=NETWORK_WIRE_DISCONNECT;
				rt_sprintf(common,"common_rx%d",i);
				tid_common_r[i] = rt_thread_create(common,common_r, (void *)(i*2+1),2048, 20, 10);
				if(tid_common_r[i]!=RT_NULL)
					rt_thread_startup(tid_common_r[i]);
			}
		}
	}
	print_config(g_conf);
	//rt_thread_delay(700);
	if(bus_speed_mode==0)
	{
		if(dev==DEV_USB||dev==DEV_BUS)
		{
			g_chang[0].cs=g_chang[0].lip6c=g_chang[0].lpc=g_chang[0].mode=g_chang[0].protol=g_chang[0].rip4c=g_chang[0].rip6c=g_chang[0].rpc=0;
			socket_thread_start(0);
		}	
		else
			for(i=0;i<4;i++)
			{
				g_chang[i].cs=g_chang[i].lip6c=g_chang[i].lpc=g_chang[i].mode=g_chang[i].protol=g_chang[i].rip4c=g_chang[i].rip6c=g_chang[i].rpc=0;
				socket_thread_start(i);
			}
	}
	//rt_thread_delay(100);
	//list_mem1();	
	//list_tcps1();
	//list_thread();
	DBG("common_init ok\r\n");
	g_puiEpi = (uint8_t *)0x60000000;
	//rt_uint8_t *buf=(rt_uint8_t *)sram_malloc(973);
	//rt_kprintf("addr 0x%08x\n",buf);
	//volatile rt_uint8_t *buf = (uint8_t *)0x60000000;
	//memset(buf,'E',1029);
	//for(i=0;i<1029;i++)
	//	rt_kprintf("%c ",buf[i]);
	//list_mem1();	
	if(bus_speed_mode)
	rt_thread_startup(rt_thread_create("bus_speed",bus_speed_test, 0,4096, 20, 10));
	return 1;
}
#endif
